app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])

INSERT INTO "books" ("title", "author", "published_date", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "The Ruthless Elimination of Hurry"], ["author", nil], ["published_date", nil], ["price", nil], ["created_at", "2024-09-04 02:52:41.360101"], ["updated_at", "2024-09-04 02:52:41.360101"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "published_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["published_date", "2016-04-16"], ["updated_at", "2024-09-04 02:58:30.419366"], ["id", 3]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy